==========
[instructions/comment] inline comment after opcode without space
==========
foo# bar
---

(program
  (instruction
    opcode: (opcode))
  (line_comment))

==========
[instructions/comment] inline C style comment after opcode without space
==========
foo// bar
---

(program
  (instruction
    opcode: (opcode))
  (line_comment))

==========
[instructions/comment] inline C style block comment after opcode without space
==========
foo/* bar */
---

(program
  (instruction
    opcode: (opcode)
    (block_comment)))

==========
[instructions/comment] inline comment after opcode with space
==========
foo # bar
---

(program
  (instruction
    opcode: (opcode))
  (line_comment))

==========
[instructions/comment] inline C style comment after opcode with space
==========
foo // bar
---

(program
  (instruction
    opcode: (opcode))
  (line_comment))

==========
[instructions/comment] inline C style block comment after opcode with space
==========
foo /* bar */
---

(program
  (instruction
    opcode: (opcode))
  (block_comment))

==========
[instructions/comment] inline comment after operands without space
==========
foo $t0# bar
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)))
  (line_comment))

==========
[instructions/comment] inline C style comment after operands without space
==========
foo $t0// bar
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)))
  (line_comment))

==========
[instructions/comment] inline C style block comment after operands without space
==========
foo $t0/* bar */
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)))
  (block_comment))

==========
[instructions/comment] inline comment after operands with space
==========
foo $t0 # bar
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)))
  (line_comment))

==========
[instructions/comment] inline C style comment after operands with space
==========
foo $t0 // bar
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)))
  (line_comment))

==========
[instructions/comment] inline C style block comment after operands with space
==========
foo $t0 /* bar */
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)))
  (block_comment))

==========
[instructions/comment] inline C style block comment before comma
==========
foo $t0/* bar */,$t0
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (register)
      (block_comment)
      operand: (register))))

==========
[instructions/comment] inline C style block comment before operator
==========
foo $t0/* bar */ + $t0
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (binary_expression
        left: (register)
        (block_comment)
        operator: (additive_operator)
        right: (register)))))

==========
[instructions/comment] C style block comment between opcode and operands without space
==========
foo/* bar */$t0
---

(program
  (instruction
    opcode: (opcode)
    (block_comment)
    operands: (operands
      operand: (register))))

==========
[instructions/comment] C style block comment between opcode and operands with space before
==========
foo /* bar */$t0
---

(program
  (instruction
    opcode: (opcode)
    (block_comment)
    operands: (operands
      operand: (register))))

==========
[instructions/comment] C style block comment between opcode and operands with space after
==========
foo/* bar */ $t0
---

(program
  (instruction
    opcode: (opcode)
    (block_comment)
    operands: (operands
      operand: (register))))

==========
[instructions/comment] call expression with C style block comment after opcode
==========
foo/* bar */(1, 2)
---

(program
  (instruction
    opcode: (opcode)
    (block_comment)
    operands: (operands
      operand: (decimal)
      operand: (decimal))))

==========
[instructions/comment] call expression with C style block comment before operands
==========
foo(/* bar */1, 2)
---

(program
  (instruction
    opcode: (opcode)
    (block_comment)
    operands: (operands
      operand: (decimal)
      operand: (decimal))))

==========
[instructions/comment] call expression with C style block comment after operands
==========
foo(1, 2/* baz */)
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      operand: (decimal)
      operand: (decimal))))
